[{
	"name": "Octo Consulting Group",
	"date": "Nov 2017 - Present",
	"url": "https://octoconsulting.com/",
	"location": "Reston, VA",
	"subtitles": ["Associate Consultant/Intern"],
	"descriptions": ["Continuing work on FaqToBot project initially developed at RamHacks."]
}, {
	"name": "Innovative Defense Technologies",
	"date": "May 2017 - Aug 2017",
	"url": "https://idtus.com/",
	"location": "Arlington, VA",
	"subtitles": ["Software Engineering Intern"],
	"descriptions": ["Besides working on various bug fixes and feature implementations, my main work was in inserting a chat tool into a web application on a stack of <span class=\"highlight\">PostGreSQL, C++, Java, Python, Typescript, and HTML/CSS</span>. The great success of this internship was in my exposure to different libraries (Backbone, Underscore, dhtmlx, Foundation) and to an industry programming workflow (projects with dozens of people). In contrast to my previous internship experience, this internship was fast-paced and filled to the brim with learning opportunities."]
}, {
	"name": "USACE Geospatial Research Labratory",
	"date": "Jun 2015 - Aug 2015",
	"url": "http://www.erdc.usace.army.mil/Locations/GRL.aspx",
	"location": "Alexandria, VA",
	"subtitles": ["Research Scientist Intern"],
	"descriptions": ["Under a computer scientist mentor, I researched a spatial index called the pivot index. I spent a few days reading papers on the pivot index, followed by developing different <span class=\"highlight\">Python</span> optimizations to reduce K nearest neighbor computational costs. The chance to delve into a complicated (or at least it seemed that way to my high school self) topic sparked my interest in research and the plentiful subjects under the realm of computer science."]
}, {
	"name": "TJ MSTI App Development Camp",
	"date": "Jun 2014 - Aug 2014",
	"url": "http://tjpartnershipfund.org/tjpartnershipfund/outreach/middle-schl-tech-institute/",
	"location": "Fairfax, VA",
	"subtitles": ["Teaching Assistant"],
	"descriptions": ["I taught four 1-week summer camp sessions, introducing middle school students to drag-and-drop mobile app development. I led workshops and worked one-on-one with students. I daresay my ability to communicate improved after this camp."]
}, {
	"name": "Independent",
	"date": "Spring 2014 - Spring 2016",
	"url": "",
	"location": "Alexandria, VA",
	"subtitles": ["Math Tutor"],
	"descriptions": ["Independent of any program, I tutored two students weekly in math topics, ranging from Pre-Algebra up to Pre-Calculus. A proud moment was when one of my students pushed her grade from near failing to an A."]
}]
